In [47]:
import os
import mysql.connector
import pandas as pd

In [48]:
import warnings
warnings.filterwarnings("ignore")

In [49]:
## making connections to database server
connection=mysql.connector.connect(host = '18.136.157.135',user='dm_user_sql',
                                  password='37z49REb$nK@nlpV!vJ')

In [50]:
pd.read_sql_query("show databases",connection)

             Database
0  information_schema
1       datamites_sql

In [51]:
connection=mysql.connector.connect(host = '18.136.157.135',user='dm_user_sql',
                                  password='37z49REb$nK@nlpV!vJ',database='datamites_sql')

In [52]:
pd.read_sql_query("show tables",connection)

  Tables_in_datamites_sql
0                 Country
1               customers
2                    dept
3                     emp
4                  orders
5                products
6                salgrade

In [53]:
emp = pd.read_sql_query("select * from emp",connection)

In [54]:
type(emp)

pandas.core.frame.DataFrame

In [55]:
emp.to_csv('emp_db.csv')

In [56]:
emp

    empno   ename        job     mgr    hiredate     sal    comm  deptno
0    7369   SMITH      CLERK  7902.0  1993-06-13   800.0     0.0      20
1    7499   ALLEN   SALESMAN  7698.0  1998-08-15  1600.0   300.0      30
2    7521    WARD   SALESMAN  7698.0  1996-03-26  1250.0   500.0      30
3    7566   JONES    MANAGER  7839.0  1995-10-31  2975.0     NaN      20
4    7654  MARTIN   SALESMAN  7698.0  1998-12-05  1250.0  1400.0      30
5    7698   BLAKE    MANAGER  7839.0  1992-06-11  2850.0     NaN      30
6    7782   CLARK    MANAGER  7839.0  1993-05-14  2450.0     NaN      10
7    7788   SCOTT    ANALYST  7566.0  1996-03-05  3000.0     NaN      20
8    7839    KING  PRESIDENT     NaN  1990-06-09  5000.0     0.0      10
9    7844  TURNER   SALESMAN  7698.0  1995-06-04  1500.0     0.0      30
10   7876   ADAMS      CLERK  7788.0  1999-06-04  1100.0     NaN      20
11   7900   JAMES      CLERK  7698.0  2000-06-23   950.0     NaN      30
12   7902    FORD    ANALYST  7566.0  1997-12-05  3000.0     NaN      20
13   7934  MILLER      CLERK  7782.0  2000-01-21  1300.0     NaN      10

In [57]:
query="select * from emp where ename like 'j%'"
data=pd.read_sql_query(query,connection)

In [58]:
data

   empno  ename      job   mgr    hiredate     sal  comm  deptno
0   7566  JONES  MANAGER  7839  1995-10-31  2975.0  None      20
1   7900  JAMES    CLERK  7698  2000-06-23   950.0  None      30

In [59]:
# find the average salary of different jobs

In [60]:
query="select job, avg(sal) from emp group by job"
data=pd.read_sql_query(query,connection)
data

         job     avg(sal)
0    ANALYST  3000.000000
1      CLERK  1037.500000
2    MANAGER  2758.333333
3  PRESIDENT  5000.000000
4   SALESMAN  1400.000000

In [61]:
pd.read_sql_query("select job, avg(sal) from emp group by job",connection)

         job     avg(sal)
0    ANALYST  3000.000000
1      CLERK  1037.500000
2    MANAGER  2758.333333
3  PRESIDENT  5000.000000
4   SALESMAN  1400.000000

In [62]:
cursor=connection.cursor()
cursor.execute('show databases') ## Check the number of databases available on the server
for i in cursor:
    print(i)

('information_schema',)
('datamites_sql',)